In [34]:
import pandas as pd
a=[[12,34,56,67,78],[12,34,56,67,78]]
df=pd.DataFrame(a)
df

    0   1   2   3   4
0  12  34  56  67  78
1  12  34  56  67  78

In [35]:
import pandas as pd  
df = pd.DataFrame()  
print (df)

Empty DataFrame
Columns: []
Index: []

In [36]:
import pandas as pd 
l=[10,11,12,13,14,55]

df = pd.DataFrame(l)  
print (df)

    0
0  10
1  11
2  12
3  13
4  14
5  55

In [37]:
import pandas as pd 
l={'id':[1,2,3],'name':['haresh','shailesh','mohit'],'contact number':[9199138413,2454673221,1357974268]}

df = pd.DataFrame(l)  
print (df)

   id      name  contact number
0   1    haresh      9199138413
1   2  shailesh      2454673221
2   3     mohit      1357974268

In [38]:
import pandas as pd  
 
ans={'design':pd.Series([1,2,3],index=['a','b','c']),'android':pd.Series([10,11,12],index=['a','b','c'])} 
 
rs=pd.DataFrame(ans) 
rs['flutter']=pd.Series([20,30,40],index=['a','b','c']) 
print(rs)

   design  android  flutter
a       1       10       20
b       2       11       30
c       3       12       40

In [39]:
import pandas as pd 

ans={'design':pd.Series([1,2,3],index=['a','b','c']),'android':pd.Series([10,11,12],index=['a','b','c'])}

rs=pd.DataFrame(ans)
rs['flutter']=pd.Series([20,30,40],index=['a','b','c'])
print(rs)

   design  android  flutter
a       1       10       20
b       2       11       30
c       3       12       40

In [40]:
import pandas as pd  
 
ans={'design':pd.Series([1,2,3],index=['a','b','c']),'android':pd.Series([10,11,12],index=['a','b','c'])} 
 
rs=pd.DataFrame(ans) 
rs['flutter']=pd.Series([20,30,40],index=['a','b','c']) 
 
rs['python']=rs['design']+rs['android'] 
print(rs)

   design  android  flutter  python
a       1       10       20      11
b       2       11       30      13
c       3       12       40      15

In [41]:
import pandas as pd  
 
ans={'design':pd.Series([1,2,3],index=['a','b','c']),'android':pd.Series([10,11,12],index=['a','b','c'])} 
 
rs=pd.DataFrame(ans) 
rs['flutter']=pd.Series([20,30,40],index=['a','b','c']) 
 
rs['python']=rs['design']+rs['android'] 
print(rs) 
 
del rs['design'] 
print(rs) 
 
# rs.pop('design')

   design  android  flutter  python
a       1       10       20      11
b       2       11       30      13
c       3       12       40      15
   android  flutter  python
a       10       20      11
b       11       30      13
c       12       40      15

In [42]:
import pandas as pd  
 
ans={'design':pd.Series([1,2,3],index=['a','b','c']),'android':pd.Series([10,11,12],index=['a','b','c'])} 
 
rs=pd.DataFrame(ans)
rs['flutter']=pd.Series([20,30,40],index=['a','b','c']) 
 
rs['python']=rs['design']+rs['android'] 
print(rs)
print(rs.android)

   design  android  flutter  python
a       1       10       20      11
b       2       11       30      13
c       3       12       40      15
a    10
b    11
c    12
Name: android, dtype: int64

In [43]:
import pandas as pd 
l={'id':[1,2,3],'name':['haresh','shailesh','mohit'],'contact number':[9199138413,2454673221,1357974268]}

df = pd.DataFrame(l)  
print (df) 
df.loc[0]

   id      name  contact number
0   1    haresh      9199138413
1   2  shailesh      2454673221
2   3     mohit      1357974268

id                         1
name                  haresh
contact number    9199138413
Name: 0, dtype: object

In [44]:
df.loc[1:1,'name']

1    shailesh
Name: name, dtype: object

In [45]:
df.loc[[0,2]]

   id    name  contact number
0   1  haresh      9199138413
2   3   mohit      1357974268

In [46]:
df.loc[:,["name",'id']]

       name  id
0    haresh   1
1  shailesh   2
2     mohit   3

In [47]:
df.loc[0:3]

   id      name  contact number
0   1    haresh      9199138413
1   2  shailesh      2454673221
2   3     mohit      1357974268

In [48]:
df.loc[:,"id":"name"]

   id      name
0   1    haresh
1   2  shailesh
2   3     mohit

In [49]:
print(df.iloc[1])

id                         2
name                shailesh
contact number    2454673221
Name: 1, dtype: object

In [50]:
print(df.iloc[2, 2])

1357974268

In [51]:
import pandas as pd 
l={'color':['red', 'brown', 'yellow' ],'bag':[3,4,3],'total':[3,4,3]}

df = pd.DataFrame(l)  
print (df) 
df.iloc[:,[2,2]]

    color  bag  total
0     red    3      3
1   brown    4      4
2  yellow    3      3

   total  total
0      3      3
1      4      4
2      3      3

In [52]:
import pandas as pd 

l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,9,1,8,7,5]}

df = pd.DataFrame(l)
print(df)
# color index remove
df = df.drop('color', axis=1)
print(df.iloc[1:])

    color  t-shirt  shirt
0     red        3      3
1   brown        4      4
2  yellow        3      3
3    blue        2      2
4   black        6      6
5   green        3      9
6     red        1      1
7  Orange        3      8
8   White        7      7
9  Purple        1      5
   t-shirt  shirt
1        4      4
2        3      3
3        2      2
4        6      6
5        3      9
6        1      1
7        3      8
8        7      7
9        1      5

In [53]:
import pandas as pd 

l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}

df = pd.DataFrame(l)

# only odd number print
print(df.iloc[1::2])

    color  t-shirt  shirt
1   brown        4      4
3    blue        2      2
5   green        3      3
7  Orange        3      3
9  Purple        1      1

In [54]:
import pandas as pd

l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}

df = pd.DataFrame(l)

# 3 number remove
df = df[(df['t-shirt'] != 3) & (df['shirt'] != 3)]

print(df)

    color  t-shirt  shirt
1   brown        4      4
3    blue        2      2
4   black        6      6
6     red        1      1
8   White        7      7
9  Purple        1      1

In [55]:
import pandas as pd
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
filtered_df = df[(df['t-shirt'] < 5) & (df['shirt'] < 5)]
print(filtered_df)

    color  t-shirt  shirt
0     red        3      3
1   brown        4      4
2  yellow        3      3
3    blue        2      2
5   green        3      3
6     red        1      1
7  Orange        3      3
9  Purple        1      1

In [56]:
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
print(df.iloc[0::2])

    color  t-shirt  shirt
0     red        3      3
2  yellow        3      3
4   black        6      6
6     red        1      1
8   White        7      7

In [57]:
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt'] 
print(df)

    color  t-shirt  shirt  total
0     red        3      3      6
1   brown        4      4      8
2  yellow        3      3      6
3    blue        2      2      4
4   black        6      6     12
5   green        3      3      6
6     red        1      1      2
7  Orange        3      3      6
8   White        7      7     14
9  Purple        1      1      2

In [58]:
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt']  
df_filtered = df[df['total'] <= 10]
print(df_filtered)

    color  t-shirt  shirt  total
0     red        3      3      6
1   brown        4      4      8
2  yellow        3      3      6
3    blue        2      2      4
5   green        3      3      6
6     red        1      1      2
7  Orange        3      3      6
9  Purple        1      1      2

In [59]:
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt']
row = 0 
print(df.iloc[row])

color      red
t-shirt      3
shirt        3
total        6
Name: 0, dtype: object

In [60]:
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt']
print(df.loc[:,"color"] )

0       red
1     brown
2    yellow
3      blue
4     black
5     green
6       red
7    Orange
8     White
9    Purple
Name: color, dtype: object

In [61]:
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt']
print(df.loc[[2,9,6,1]])

    color  t-shirt  shirt  total
2  yellow        3      3      6
9  Purple        1      1      2
6     red        1      1      2
1   brown        4      4      8

In [62]:
# 1
import pandas as pd 
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt']
print(df.iloc[8])

color      White
t-shirt        7
shirt          7
total         14
Name: 8, dtype: object

In [63]:
import pandas as pd
l = {'color': ['red', 'brown', 'yellow','blue','black','green','red','Orange','White','Purple'], 't-shirt': [3,4,3,2,6,3,1,3,7,1], 'shirt': [3,4,3,2,6,3,1,3,7,1]}
df = pd.DataFrame(l)
df['total']=df['t-shirt']+df['shirt']
df.iloc[:,[0,2]]

    color  shirt
0     red      3
1   brown      4
2  yellow      3
3    blue      2
4   black      6
5   green      3
6     red      1
7  Orange      3
8   White      7
9  Purple      1

In [64]:
df.iloc[list(df['total']>=8)]

   color  t-shirt  shirt  total
1  brown        4      4      8
4  black        6      6     12
8  White        7      7     14

In [65]:
import pandas as pd
l=pd.read_csv(r"C:\Users\DELL\Desktop\DEMO.csv")
df = pd.DataFrame(l)
null = df[df.iloc[:, 4].isnull()]
print(null)

             COMPANY NAME       CITY    STATE WEBSITE CONTACT NUMBER
0        Balaji jewellers     Talala  Gujarat     NaN            NaN
4      Tirthraj jewellers    Veraval  Gujarat     NaN            NaN
6          Sagar Jewelers  Sutrapada  Gujarat     NaN            NaN
9        Kumkum jewellers    Diyodar  Gujarat     NaN            NaN
10    Bholenath Jewellers     Keshod  Gujarat     NaN            NaN
...                   ...        ...      ...     ...            ...
1488     RAMJI VELJI SONI   Kutiyana  Gujarat     NaN            NaN
1489     Deepak Jewellers     Tukada  Gujarat     NaN            NaN
1498     Dhaval Jewellers     Rajkot  Gujarat     NaN            NaN
1500       Riya Jewellers     Rajkot  Gujarat     NaN            NaN
1502      krupa jewellers     Rajkot  Gujarat     NaN            NaN

[572 rows x 5 columns]

In [68]:
import pandas as pd
df = pd.read_csv(r"C:\Users\DELL\Desktop\DEMO.csv")
null_rows = df[df.iloc[:, 3].isnull()]
df.iloc[:, 4].fillna("abcd", inplace=True)
print(df)
print(null_rows)

               COMPANY NAME     CITY    STATE WEBSITE CONTACT NUMBER
0          Balaji jewellers   Talala  Gujarat     NaN           abcd
1            Brij Jewellers   Talala  Gujarat     NaN    99790 47450
2        vatsalya Jewellers   Talala  Gujarat     NaN    77780 85372
3     Jay Somnath Jewellers   Talala  Gujarat     NaN    97122 84884
4        Tirthraj jewellers  Veraval  Gujarat     NaN           abcd
...                     ...      ...      ...     ...            ...
1498       Dhaval Jewellers   Rajkot  Gujarat     NaN           abcd
1499       Vishal Jewellers   Rajkot  Gujarat     NaN    98245 94147
1500         Riya Jewellers   Rajkot  Gujarat     NaN           abcd
1501     Madhuvan Jewellers   Rajkot  Gujarat     NaN   281 223 2681
1502        krupa jewellers   Rajkot  Gujarat     NaN           abcd

[1503 rows x 5 columns]
               COMPANY NAME     CITY    STATE WEBSITE CONTACT NUMBER
0          Balaji jewellers   Talala  Gujarat     NaN            NaN
1            Brij Jewellers   Talala  Gujarat     NaN    99790 47450
2        vatsalya Jewellers   Talala  Gujarat     NaN    77780 85372
3     Jay Somnath Jewellers   Talala  Gujarat     NaN    97122 84884
4        Tirthraj jewellers  Veraval  Gujarat     NaN            NaN
...                     ...      ...      ...     ...            ...
1498       Dhaval Jewellers   Rajkot  Gujarat     NaN            NaN
1499       Vishal Jewellers   Rajkot  Gujarat     NaN    98245 94147
1500         Riya Jewellers   Rajkot  Gujarat     NaN            NaN
1501     Madhuvan Jewellers   Rajkot  Gujarat     NaN   281 223 2681
1502        krupa jewellers   Rajkot  Gujarat     NaN            NaN

[1311 rows x 5 columns]

In [1]:
import pandas as pd  
df = pd.read_csv(r"C:\Users\DELL\Desktop\DEMO.csv")
remove_null = df.dropna()
print(remove_null)

                                           COMPANY NAME  \
76    Balaji Jewellers - Best Jewellery Showroom in ...
100     Panchal Rasiklal Narandas (Ranervala) Jewellers
121   K VIRCHANDBHAI GOLD PALACE (MANUNDWALA)-BEST J...
131                                   Rakshit jewellers
133            Choksi Dashrathlal Ranchhodlal Jewellers
...                                                 ...
1485                                    Sonal Jewellers
1491  Jogia Jeweler's - Best Diamond Jewellery Showr...
1492  ???????????????? ???????????? - Best Jewellers...
1494                                     Shiv Jewellers
1495                                  Namrata Jewellers

                        CITY    STATE  \
76                       Una  Gujarat
100   Patan, Gungdipati Part  Gujarat
121   Patan, Gungdipati Part  Gujarat
131                  Veraval  Gujarat
133   Patan, Gungdipati Part  Gujarat
...                      ...      ...
1485               Porbandar  Gujarat
1491               Porbandar  Gujarat
1492               Porbandar  Gujarat
1494               Porbandar  Gujarat
1495               Porbandar  Gujarat

                                                WEBSITE CONTACT NUMBER
76    https://website--7119184878500352152250-jewelr...    94289 50263
100   https://sites.google.com/view/ranervalajewelle...    97251 54502
121                       http://www.kvirchandbhai.com/    98245 50851
131      https://www.instagram.com/rakshitjewellers916/    98793 77776
133   https://choksi-dashrathlal-ranchhodlal-jewelle...    76988 76871
...                                                 ...            ...
1485  https://website--3827310146334368232190-jewelr...    70164 78311
1491                     http://www.jogiajewellers.com/    98257 81656
1492            https://www.facebook.com/ashapurajewels    98255 90121
1494    https://shiv-jewellers-goldsmith.business.site/    94277 34942
1495            http://sites.google.com/view/myjeweller    94091 24501

[131 rows x 5 columns]

In [6]:
remove_null = df.loc[~df.isnull().any(axis=1)]
print(remove_null)

                                           COMPANY NAME  \
76    Balaji Jewellers - Best Jewellery Showroom in ...
100     Panchal Rasiklal Narandas (Ranervala) Jewellers
121   K VIRCHANDBHAI GOLD PALACE (MANUNDWALA)-BEST J...
131                                   Rakshit jewellers
133            Choksi Dashrathlal Ranchhodlal Jewellers
...                                                 ...
1485                                    Sonal Jewellers
1491  Jogia Jeweler's - Best Diamond Jewellery Showr...
1492  ???????????????? ???????????? - Best Jewellers...
1494                                     Shiv Jewellers
1495                                  Namrata Jewellers

                        CITY    STATE  \
76                       Una  Gujarat
100   Patan, Gungdipati Part  Gujarat
121   Patan, Gungdipati Part  Gujarat
131                  Veraval  Gujarat
133   Patan, Gungdipati Part  Gujarat
...                      ...      ...
1485               Porbandar  Gujarat
1491               Porbandar  Gujarat
1492               Porbandar  Gujarat
1494               Porbandar  Gujarat
1495               Porbandar  Gujarat

                                                WEBSITE CONTACT NUMBER
76    https://website--7119184878500352152250-jewelr...    94289 50263
100   https://sites.google.com/view/ranervalajewelle...    97251 54502
121                       http://www.kvirchandbhai.com/    98245 50851
131      https://www.instagram.com/rakshitjewellers916/    98793 77776
133   https://choksi-dashrathlal-ranchhodlal-jewelle...    76988 76871
...                                                 ...            ...
1485  https://website--3827310146334368232190-jewelr...    70164 78311
1491                     http://www.jogiajewellers.com/    98257 81656
1492            https://www.facebook.com/ashapurajewels    98255 90121
1494    https://shiv-jewellers-goldsmith.business.site/    94277 34942
1495            http://sites.google.com/view/myjeweller    94091 24501

[131 rows x 5 columns]